{
  "main": {
    "name":"Sydney Friedman",
    "description":"A fullstack software engineer with code crafted in the same creative precision and pattern recognition as applied to storytelling",
    "image":"profile.jpg",
    "bio": "",
    "contactmessage":"Don`t hesitate to get in touch. Let`s create, innovate, and grow together!",
    "email": "friedman.sydneyl@gmail.com",
    "phone": "",
    "github":"https://github.com/sydfried42",
    "project":"https://www.linkedin.com/in/sydney-friedman/",
    "address":{
      "street":"(Your Street)",
      "city":"Queens",
      "state":"New York",
      "zip": "11372"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/1c7_OfFsn9_fMeoCjM8vD_tcQsiWiXqTg/view?usp=sharing",
    "social":[
      
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/sydney-friedman/",
        "className":"fa fa-linkedin"
      },
      
      {
        "name":"github",
        "url":"https://github.com/sydfried42",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Designing and developing interactive web applications with JavaScript, React, and Python Flask, implementing robust APIs, dynamic user interfaces, and ensuring data accuracy and security through meticulous backend integration.",
    "education":[
      {
        "school":"Flatiron School",
        "degree":"Software Engineering",
        "graduated":"May 2024",
        "description":"15-week intensive software engineering program covering full-stack web development, including HTML, CSS, JavaScript, React, Python, Flask, and SQL. Gained proficiency in building, testing, and deploying software applications through hands-on projects and pair programming, with an emphasis on collaboration and problem-solving."
      },
      {
        "school":"University of Michigan",
        "degree":"BA Screen Arts and Culture",
        "graduated":"April 2015",
        "description":"Developed a keen ability to integrate theoretical knowledge, historical context, and critical thinking with hands-on experience in industry-standard team projects, refining skills in film editing and collaborative production."
      }
    ],
    "work":[
      {
        "company":"DiscNY",
        "title":"Volunteer, High School League Commissioner",
        "years":"2018 - Present",
        "description":"Developed and managed web applications to streamline both internal and external structures, focusing on registration and volunteer organization. In organizing youth, coordinated and communicated efficiently across four divisions, 27 schools, and 42 teams using multiple platforms. Oversaw and supported coaches and team captains to ensure effective leadership and adherence to the `Spirit of the Game` on and off the field."
      },
      {
        "company":"FedUp Collective",
        "title":"Technical Lead",
        "years":"2020 - 2022",
        "description":"Managed the company website to ensure it accurately represented team operations and facilitated communication with customers and the community, prioritizing a comprehensive and accessible user experience. Conducted technical research, developed gender-affirming guides, and led over 50 training sessions and support groups for more than 100 clients and providers in the trans+ and intersex community. Collaborated with the nonprofit board and colleagues in operations, finance, and grant departments to complete budgets and grant applications, securing $110,000 in funding."
      },
      {
        "company":"Freelance Film Editor",
        "title":"Clients include: HBO, Netflix, Warner Brothers, Paramount, Viacom, National Geographic, Peacock",
        "years":"2015 - Present",
        "description":"Partnered with major media and entertainment clients to design and execute full-scale productions, earning accolades including the Oscars Shortlist, Sundance, and AFI. Leveraged technical software for editing to develop tests, troubleshoot errors, and refine visual outputs for clients, ensuring that customer feedback was integrated into the final product. Directed operations for over 50 projects and customer accounts across TV, film, commercial, and nonprofit sectors, successfully completing more than 100 productions on time and under budget."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"React.Js",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML",
        "level":"90%"
      },
      {
        "name":"Playwright",
        "level":"10%"
      },
      {
        "name":"SQL",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"DiscNY Ultimate Frisbee Volunteer Tracker Tool",
        "category":"Full stack application to efficiently organize volunteer hours and track as redeemable points for activities and events",
        "image":"01.jpg",
        "url":"https://github.com/sydfried42/ultimate-volunteer-tracker"
      },
      {
        "title":"DiscNY High School Ultimate Frisbee League Admin Tool",
        "category":"Full stack application for league registration and organization",
        "image":"02.jpg",
        "url":"https://github.com/sydfried42/DiscNY-High-School-Ultimate-Frisbee-League-Admin-Tool"
      },
      {
        "title":"Pantry2Plate",
        "category":"Full stack application allowing users to input pantry items, select desired ingredients, and find recipes",
        "image":"03.jpg",
        "url":"https://plate.sydneylfriedman.com/"
      },
      {
        "title":"Mario Brick Pygame",
        "category":"A Mario themed brickbreaker pygame",
        "image":"04.jpg",
        "url":""
      }
    ]
  }
}
